package com.example.denpotap.autotrade;

public class MyArrays {
    public static String[] car1urls = {"https://i.ibb.co/Ph2GMYx/mercedes-benz-c-63-amg-6.jpg", "https://i.ibb.co/PNM67kh/mercedes-benz-c-63-amg-1.jpg",
    "https://i.ibb.co/dc7vdbh/mercedes-benz-c-63-amg-2.jpg", "https://i.ibb.co/ckgsDC2/mercedes-benz-c-63-amg-3.jpg",
    "https://i.ibb.co/LDKsz3B/mercedes-benz-c-63-amg-4.jpg", "https://i.ibb.co/D9B3mfC/mercedes-benz-c-63-amg-5.jpg"};
    public static String[] car2urls = {"https://i.ibb.co/rcVgG1y/mercedes-benz-c-200-5.jpg", "https://i.ibb.co/b2htspT/mercedes-benz-c-200-1.jpg",
    "https://i.ibb.co/Hx6N2pz/mercedes-benz-c-200-2.jpg", "https://i.ibb.co/0GcV7v3/mercedes-benz-c-200-3.jpg",
    "https://i.ibb.co/w0v6pdv/mercedes-benz-c-200-4.jpg"};
    public static String[] car3urls = {"https://i.ibb.co/D73TmWg/mercedes-benz-c-220-5.jpg", "https://i.ibb.co/q7H4HpL/mercedes-benz-c-220-1.jpg",
    "https://i.ibb.co/dgHrkG9/mercedes-benz-c-220-2.jpg", "https://i.ibb.co/QkzkRRk/mercedes-benz-c-220-3.jpg",
    "https://i.ibb.co/WWxd36y/mercedes-benz-c-220-4.jpg"};
    public static String[] car4urls = {"https://i.ibb.co/CKYZS3t/merc.jpg", "https://i.ibb.co/mHqK06x/merc.jpg"};
    public static String[] car5urls = {"https://i.ibb.co/X74FSHq/car1.jpg", "https://i.ibb.co/4gCKPkQ/car1.jpg", "https://i.ibb.co/S3HSpyh/car1.jpg"};
    public static String[] car6urls = {"https://i.ibb.co/HBkgZyR/car2.jpg", "https://i.ibb.co/qyMHW0k/car2.jpg"};
    public static String[] car7urls = {"https://i.ibb.co/BG3bwgx/car3.jpg", "https://i.ibb.co/R2d44Kh/car3.jpg"};
    public static String[] car8urls = {"https://i.ibb.co/m09jRkt/car4.jpg", "https://i.ibb.co/3MPD2K7/car4.jpg"};
    public static String[] car9urls = {"https://i.ibb.co/X7b2VY6/car5.jpg", "https://i.ibb.co/w69M91h/car5.jpg"};
    public static String[] car10urls = {"https://i.ibb.co/HXyR57B/car6.jpg", "https://i.ibb.co/KrLBbwC/car6.jpg"};
    public static String[] car11urls = {"https://i.ibb.co/h70n3Tr/car7.jpg", "https://i.ibb.co/Ws4Myq1/car7.jpg"};

    public static String[][] arrays = {car1urls, car2urls, car3urls, car4urls, car5urls, car6urls, car7urls, car8urls, car9urls, car10urls, car11urls};

    public static String[] transmissions = {"Автоматическая", "Механическая", "Механическая", "Механическая", "Автоматическая",
            "Автоматическая", "Автоматическая", "Механическая", "Механическая", "Механическая", "Автоматическая"};
    public static String[] fuel = {"Бензин", "Бензин", "Дизтопливо", "Дизтопливо", "Дизтопливо", "Бензин", "Бензин",
            "Бензин", "Дизтопливо", "Дизтопливо", "Бензин"};
    public  static String[] capacity = {"6.2", "1.8", "2.1", "2.1", "3.0", "3.5", "6.2", "1.8", "2.1", "2.1", "3.0"};
    public  static String[] wheelDrive = {"Передний", "Задний", "Задний", "Полный", "Задний", "Задний", "Задний",
            "Задний", "Задний", "Задний", "Задний"};
    public static String[] consumption = {"12.0", "6.6", "4.4", "4.8", "4.0", "6.8", "10.3", "6.6", "5.5", "5.5", "9.3"};
    public static String[] power = {"457", "184", "170", "204", "231", "306", "525", "184", "170", "204", "231"};
    public static String[] rate = {"10", "9", "8", "7", "6", "5", "4", "3", "2", "1", "0"};
    public static String[] prices = {"100000", "30000", "27000", "32000", "40000", "50000", "105000", "28000", "29000", "33000", "39000"};

    public static String[] detailsBrands = {"Mercedes-Benz C63 AMG", "Mercedes-Benz C 200", "Mercedes-Benz C 220",
        "Mercedes-Benz C 250", "Mercedes-Benz C 300", "Mercedes-Benz C 350", "Mercedes-Benz E 63 AMG",
        "Mercedes-Benz E 200", "Mercedes-Benz E 220", "Mercedes-Benz E 250", "Mercedes-Benz E 300"};

    public static String[]bodies = {"4 дв. седан (W204)", "4 дв. седан (W204)", "4 дв. седан (W204)", "4 дв. седан (W204)", "4 дв. седан (W204)",
            "4 дв. седан (W204)", "4 дв. седан (W212)", "4 дв. седан (W212)", "4 дв. седан (W212)", "4 дв. седан (W212)", "4 дв. седан (W212)"};
    public static String[] full = {"Кузов: 4 дв. седан (W204)\n" +
            "Двигатель Тип двигателя: V8\n" +
            "Марка топлива: бензин\n" +
            "Объем двигателя, куб. см.: 6208\n" +
            "Клапанов на цилиндр: 4\n" +
            "Мощность, л.с.: 457\n" +
            "Достигается при об. в мин.: 6800\n" +
            "Крутящий момент, Нм/об. в мин.: 600/5000\n" +
            "Максимальная скорость, км/ч: 250\n" +
            "Время разгона до 100 км/ч, сек.: 4.4\n" +
            "Расход топлива (смешанный цикл), л. на 100 км.: 12\n" +
            "Расход топлива (в городе), л. на 100 км.: 18.2\n" +
            "Расход топлива (за городом), л. на 100 км.: 8.4\n" +
            "Диaметр цилиндра, мм: 102.2\n" +
            "Ход поршня, мм: 94.6\n" +
            "Выхлоп CO2, г/км: 280\n" +
            "Коэффициент сжатия: 11.3\n" +
            "Коробка передач: АКПП\n" +
            "Количество ступеней: 7\n" +
            "Подвеска Передняя: McPherson\n" +
            "Габариты Длина, мм: 4591 Ширина, мм: 1770 Высота, мм: 1447\n" +
            "Колесная база, мм: 2760\n" +
            "Колея колес спереди, мм: 1549\n" +
            "Колея колес сзади, мм: 1552\n" +
            "Прочее\n" +
            "Количество мест: 5\n" +
            "Размер шин: 255/35R18\n" +
            "Снаряженная масса, кг: 1630\n" +
            "Допустимая масса, кг: 2185\n" +
            "Объем багажника, л: 475\n" +
            "Объем топливного бака, л: 66\n" +
            "Диаметр разворота, м: 11.1\n",

            "Кузов: 4 дв. седан (W204)\n" +
                    "Марка топлива: бензин\n" +
                    "Объем двигателя, куб. см.: 1796\n" +
                    "Клапанов на цилиндр: 4\n" +
                    "Мощность, л.с.: 184\n" +
                    "Достигается при об. в мин.: 5250\n" +
                    "Крутящий момент, Нм/об. в мин.: 270/1800\n" +
                    "Максимальная скорость, км/ч: 237\n" +
                    "Время разгона до 100 км/ч, сек.: 8.2\n" +
                    "Расход топлива (смешанный цикл), л. на 100 км.: 6.6\n" +
                    "Расход топлива (в городе), л. на 100 км.: 9.3\n" +
                    "Расход топлива (за городом), л. на 100 км.: 5.2\n" +
                    "Диaметр цилиндра, мм: 82\n" +
                    "Ход поршня, мм: 85\n" +
                    "Выхлоп CO2, г/км: 154\n" +
                    "Коэффициент сжатия: 9.3\n" +
                    "Коробка передач: МКПП\n" +
                    "Количество ступеней: 6\n" +
                    "Подвеска Передняя: McPherson\n" +
                    "Габариты Длина, мм: 4591 Ширина, мм: 1770 Высота, мм: 1447\n" +
                    "Колесная база, мм: 2760\n" +
                    "Колея колес спереди, мм: 1549\n" +
                    "Колея колес сзади, мм: 1552\n" +
                    "Прочее\n" +
                    "Количество мест: 5\n" +
                    "Размер шин: 205/55R16\n" +
                    "Снаряженная масса, кг: 1400\n" +
                    "Допустимая масса, кг: 2015\n" +
                    "Объем багажника, л: 475\n" +
                    "Объем топливного бака, л: 59\n" +
                    "Диаметр разворота, м: 10.8",

        "Кузов: 4 дв. седан (W204)\n" +
                "Марка топлива: дизельное топливо\n" +
                "Объем двигателя, куб. см.: 2143\n" +
                "Клапанов на цилиндр: 4\n" +
                "Мощность, л.с.: 170\n" +
                "Достигается при об. в мин.: 3000\n" +
                "Крутящий момент, Нм/об. в мин.: 400/1400\n" +
                "Максимальная скорость, км/ч: 232\n" +
                "Время разгона до 100 км/ч, сек.: 8.4\n" +
                "Расход топлива (смешанный цикл), л. на 100 км.: 4.4\n" +
                "Расход топлива (в городе), л. на 100 км.: 5.6\n" +
                "Расход топлива (за городом), л. на 100 км.: 3.7\n" +
                "Диaметр цилиндра, мм: 88\n" +
                "Ход поршня, мм: 88.3\n" +
                "Выхлоп CO2, г/км: 117\n" +
                "Коэффициент сжатия: 16.2\n" +
                "Коробка передач: МКПП\n" +
                "Количество ступеней: 6\n" +
                "Подвеска Передняя: McPherson\n" +
                "Габариты Длина, мм: 4591 Ширина, мм: 1770 Высота, мм: 1447\n" +
                "Колесная база, мм: 2760\n" +
                "Колея колес спереди, мм: 1549\n" +
                "Колея колес сзади, мм: 1552\n" +
                "Прочее\n" +
                "Количество мест: 5\n" +
                "Размер шин: 205/55R16\n" +
                "Снаряженная масса, кг: 1500\n" +
                "Допустимая масса, кг: 2115\n" +
                "Объем багажника, л: 475\n" +
                "Объем топливного бака, л: 66\n" +
                "Диаметр разворота, м: 10.8",

        "Кузов: 4 дв. седан (W204)\n" +
                "Марка топлива: дизельное топливо\n" +
                "Объем двигателя, куб. см.: 2143\n" +
                "Клапанов на цилиндр: 4\n" +
                "Мощность, л.с.: 204\n" +
                "Достигается при об. в мин.: 4200\n" +
                "Крутящий момент, Нм/об. в мин.: 500/1600\n" +
                "Максимальная скорость, км/ч: 240\n" +
                "Время разгона до 100 км/ч, сек.: 7\n" +
                "Расход топлива (смешанный цикл), л. на 100 км.: 4.8\n" +
                "Расход топлива (в городе), л. на 100 км.: 6.1\n" +
                "Расход топлива (за городом), л. на 100 км.: 4\n" +
                "Диaметр цилиндра, мм: 88\n" +
                "Ход поршня, мм: 88.3\n" +
                "Выхлоп CO2, г/км: 125\n" +
                "Коэффициент сжатия: 16.2\n" +
                "Коробка передач: МКПП\n" +
                "Количество ступеней: 6\n" +
                "Подвеска Передняя: McPherson\n" +
                "Габариты Длина, мм: 4591 Ширина, мм: 1770 Высота, мм: 1447\n" +
                "Колесная база, мм: 2760\n" +
                "Колея колес спереди, мм: 1549\n" +
                "Колея колес сзади, мм: 1552\n" +
                "Прочее\n" +
                "Количество мест: 5\n" +
                "Размер шин: 205/55R16\n" +
                "Снаряженная масса, кг: 1515\n" +
                "Допустимая масса, кг: 2130\n" +
                "Объем багажника, л: 475\n" +
                "Объем топливного бака, л: 66\n" +
                "Диаметр разворота, м: 10.8",

        "Кузов: 4 дв. седан (W204)\n" +
                "Двигатель Тип двигателя: V6\n" +
                "Марка топлива: дизельное топливо\n" +
                "Объем двигателя, куб. см.: 2987\n" +
                "Клапанов на цилиндр: 4\n" +
                "Мощность, л.с.: 231\n" +
                "Достигается при об. в мин.: 3800\n" +
                "Крутящий момент, Нм/об. в мин.: 540/1600\n" +
                "Максимальная скорость, км/ч: 250\n" +
                "Время разгона до 100 км/ч, сек.: 6.4\n" +
                "Диaметр цилиндра, мм: 83\n" +
                "Ход поршня, мм: 92\n" +
                "Выхлоп CO2, г/км: 185\n" +
                "Коэффициент сжатия: 15.5\n" +
                "Коробка передач: АКПП\n" +
                "Количество ступеней: 7\n" +
                "Подвеска Передняя: McPherson\n" +
                "Габариты Длина, мм: 4591 Ширина, мм: 1770 Высота, мм: 1447\n" +
                "Колесная база, мм: 2760\n" +
                "Колея колес спереди, мм: 1549\n" +
                "Колея колес сзади, мм: 1552\n" +
                "Прочее\n" +
                "Количество мест: 5\n" +
                "Размер шин: 225/45R17\n" +
                "Снаряженная масса, кг: 1635\n" +
                "Допустимая масса, кг: 2265\n" +
                "Объем багажника, л: 475\n" +
                "Объем топливного бака, л: 66\n" +
                "Диаметр разворота, м: 10.8",

        "Кузов: 4 дв. седан (W204)\n" +
                "Двигатель Тип двигателя: V6\n" +
                "Марка топлива: бензин\n" +
                "Объем двигателя, куб. см.: 3498\n" +
                "Клапанов на цилиндр: 4\n" +
                "Мощность, л.с.: 306\n" +
                "Достигается при об. в мин.: 6400\n" +
                "Крутящий момент, Нм/об. в мин.: 370/3500\n" +
                "Максимальная скорость, км/ч: 250\n" +
                "Время разгона до 100 км/ч, сек.: 6\n" +
                "Расход топлива (смешанный цикл), л. на 100 км.: 6.8\n" +
                "Расход топлива (в городе), л. на 100 км.: 9.4\n" +
                "Расход топлива (за городом), л. на 100 км.: 5.3\n" +
                "Диaметр цилиндра, мм: 92.9\n" +
                "Ход поршня, мм: 86\n" +
                "Выхлоп CO2, г/км: 159\n" +
                "Коэффициент сжатия: 12\n" +
                "Коробка передач: АКПП\n" +
                "Количество ступеней: 7\n" +
                "Подвеска Передняя: McPherson\n" +
                "Габариты Длина, мм: 4591 Ширина, мм: 1770 Высота, мм: 1447\n" +
                "Колесная база, мм: 2760\n" +
                "Колея колес спереди, мм: 1549\n" +
                "Колея колес сзади, мм: 1552\n" +
                "Прочее Количество мест: 5\n" +
                "Размер шин: 225/45R17\n" +
                "Снаряженная масса, кг: 1510\n" +
                "Допустимая масса, кг: 2125\n" +
                "Объем багажника, л: 475\n" +
                "Объем топливного бака, л: 66\n" +
                "Диаметр разворота, м: 10.8",

        "Кузов: 4 дв. седан (W212)\n" +
                "Двигатель Тип двигателя: V8\n" +
                "Марка топлива: бензин АИ-98\n" +
                "Объем двигателя, куб. см.: 6208\n" +
                "Мощность, л.с.: 525\n" +
                "Достигается при об. в мин.: 6800\n" +
                "Максимальная скорость, км/ч: 250\n" +
                "Время разгона до 100 км/ч, сек.: 4.5\n" +
                "Компоновка двигателя: Спереди, продольно\n" +
                "Система питания: Распределенный впрыск\n" +
                "Диaметр цилиндра, мм: 102.2\n" +
                "Ход поршня, мм: 94.6\n" +
                "Коэффициент сжатия: 11.3\n" +
                "Привод Тип привода: задний\n" +
                "Коробка передач: АКПП\n" +
                "Количество ступеней: 5\n" +
                "Подвеска \n" +
                "Передняя: Многорычажная подвеска\n" +
                "Задняя: Многорычажная независимая\n" +
                "Тормоза\n" +
                "Передние: Дисковые вентилируемые\n" +
                "Задние: Дисковые\n" +
                "Габариты Длина, мм: 4868 Ширина, мм: 1854 Высота, мм: 1471\n" +
                "Колесная база, мм: 2874\n" +
                "Колея колес спереди, мм: 1625\n" +
                "Колея колес сзади, мм: 1594\n" +
                "Прочее Количество мест: 5\n" +
                "Размер шин: 255/40 R18\n" +
                "Снаряженная масса, кг: 1840\n" +
                "Допустимая масса, кг: 2390",

        "Кузов: 4 дв. седан (W212)\n" +
                "Марка топлива: Бензин АИ-95\n" +
                "Объем двигателя, куб. см.: 1796\n" +
                "Мощность, л.с.: 184\n" +
                "Достигается при об. в мин.: 5250\n" +
                "Крутящий момент, Нм/об. в мин.: 270/4200\n" +
                "Максимальная скорость, км/ч: 236\n" +
                "Время разгона до 100 км/ч, сек.: 8.5\n" +
                "Расход топлива (смешанный цикл), л. на 100 км.: 6.6\n" +
                "Компоновка двигателя: спереди, продольно\n" +
                "Система питания: распределенный впрыск топлива\n" +
                "Выхлоп CO2, г/км: 159\n" +
                "Коэффициент сжатия: 9.8\n" +
                "Привод Тип привода: задний\n" +
                "Коробка передач: МКПП\n" +
                "Количество ступеней: 6\n" +
                "Подвеска \n" +
                "Передняя: трёхрычажная\n" +
                "Задняя: многорычажная\n" +
                "Тормоза\n" +
                "Передние: дисковые вентилируемые\n" +
                "Задние: дисковые\n" +
                "Габариты Длина, мм: 4868 Ширина, мм: 1854 Высота, мм: 1471\n" +
                "Колесная база, мм: 2874\n" +
                "Колея колес спереди, мм: 1585\n" +
                "Колея колес сзади, мм: 1604\n" +
                "Прочее Количество мест: 5\n" +
                "Размер шин: 205/60R16\n" +
                "Допустимая масса, кг: 1615\n" +
                "Объем багажника, л: 540\n" +
                "Объем топливного бака, л: 59\n" +
                "Диаметр разворота, м: 11.25",

        "Кузов: 4 дв. седан (W212)\n" +
                "Марка топлива: дизельное топливо\n" +
                "Объем двигателя, куб. см.: 2143\n" +
                "Мощность, л.с.: 170\n" +
                "Достигается при об. в мин.: 4200\n" +
                "Крутящий момент, Нм/об. в мин.: 400/2800\n" +
                "Максимальная скорость, км/ч: 231\n" +
                "Время разгона до 100 км/ч, сек.: 8.6\n" +
                "Расход топлива (смешанный цикл), л. на 100 км.: 5.5\n" +
                "Расход топлива (в городе), л. на 100 км.: 7\n" +
                "Расход топлива (за городом), л. на 100 км.: 4.6\n" +
                "Компоновка двигателя: спереди, продольно\n" +
                "Система питания: дизель\n" +
                "Выхлоп CO2, г/км: 139\n" +
                "Коэффициент сжатия: 16.2\n" +
                "Привод Тип привода: задний\n" +
                "Коробка передач: МКПП\n" +
                "Количество ступеней: 6\n" +
                "Подвеска\n" +
                "Передняя: трёхрычажная\n" +
                "Задняя: многорычажная\n" +
                "Тормоза \n" +
                "Передние: дисковые вентилируемые\n" +
                "Задние: дисковые\n" +
                "Габариты Длина, мм: 4868 Ширина, мм: 1854 Высота, мм: 1471\n" +
                "Колесная база, мм: 2874\n" +
                "Колея колес спереди, мм: 1585\n" +
                "Колея колес сзади, мм: 1604\n" +
                "Прочее Количество мест: 5\n" +
                "Размер шин: 205/60R16\n" +
                "Объем багажника, л: 540\n" +
                "Объем топливного бака, л: 59\n" +
                "Диаметр разворота, м: 11.25",

        "Кузов: 4 дв. седан (W212)\n" +
                "Марка топлива: дизельное топливо\n" +
                "Объем двигателя, куб. см.: 2143\n" +
                "Наддув: турбонаддув\n" +
                "Мощность, л.с.: 204\n" +
                "Достигается при об. в мин.: 4200\n" +
                "Крутящий момент, Нм/об. в мин.: 500/1800\n" +
                "Максимальная скорость, км/ч: 242\n" +
                "Время разгона до 100 км/ч, сек.: 7.9\n" +
                "Расход топлива (смешанный цикл), л. на 100 км.: 5.5\n" +
                "Расход топлива (в городе), л. на 100 км.: 7\n" +
                "Расход топлива (за городом), л. на 100 км.: 4.6\n" +
                "Компоновка двигателя: спереди, продольно\n" +
                "Система питания: дизель\n" +
                "Выхлоп CO2, г/км: 142\n" +
                "Коэффициент сжатия: 16.2\n" +
                "Привод Тип привода: задний\n" +
                "Коробка передач: МКПП\n" +
                "Количество ступеней: 6\n" +
                "Подвеска\n" +
                "Передняя: трёхрычажная\n" +
                "Задняя: многорычажная\n" +
                "Тормоза\n" +
                "Передние: дисковые вентилируемые\n" +
                "Задние: дисковые вентилируемые\n" +
                "Габариты Длина, мм: 4868 Ширина, мм:1854 Высота, мм:1471\n" +
                "Колесная база, мм: 2874\n" +
                "Колея колес спереди, мм: 1585\n" +
                "Колея колес сзади, мм: 1604\n" +
                "Прочее\n" +
                "Количество мест: 5\n" +
                "Размер шин: 225/55R16\n" +
                "Объем багажника, л: 540\n" +
                "Объем топливного бака, л: 59\n" +
                "Диаметр разворота, м: 11.25",

        "Кузов: 4 дв. седан (W212)\n" +
                "Двигатель Тип двигателя: V6\n" +
                "Марка топлива: Бензин АИ-98\n" +
                "Объем двигателя, куб. см.: 2996\n" +
                "Мощность, л.с.: 231\n" +
                "Достигается при об. в мин.: 6000\n" +
                "Крутящий момент, Нм/об. в мин.: 300/5000\n" +
                "Максимальная скорость, км/ч: 247\n" +
                "Время разгона до 100 км/ч, сек.: 7.5\n" +
                "Расход топлива (смешанный цикл), л. на 100 км.: 9.3\n" +
                "Расход топлива (в городе), л. на 100 км.: 13.1\n" +
                "Расход топлива (за городом), л. на 100 км.: 7\n" +
                "Компоновка двигателя: спереди, продольно\n" +
                "Выхлоп CO2, г/км: 217\n" +
                "Коэффициент сжатия: 11.3\n" +
                "Привод Тип привода: задний\n" +
                "Коробка передач: АКПП\n" +
                "Количество ступеней: 7\n" +
                "Вид коробки: 7G-TRONIC\n" +
                "Подвеска \n" +
                "Передняя: трёхрычажная\n" +
                "Задняя: многорычажная\n" +
                "Тормоза\n" +
                "Передние: дисковые вентилируемые\n" +
                "Задние: дисковые вентилируемые\n" +
                "Прочее\n" +
                "Размер шин: 225/55R16\n" +
                "Допустимая масса, кг: 2260\n" +
                "Объем багажника, л: 540\n" +
                "Объем топливного бака, л: 80\n" +
                "Диаметр разворота, м: 11.25"};
}
